{
  "rooms": {
    "0": {
      "name" : "Room 101",
      "size" : "40"
    },
    "1": {
      "name" : "Room 111",
      "size" : "40"
    },

    "2": {
      "name" : "Room 201",
      "size" : "60"
    },
    "3": {
      "name" : "Room 301",
      "size" : "100"
    },
    "4": {
      "name" : "Room 311",
      "size" : "40"
    }
  },
  "presenters": {
    "0": {
      "name": "Darth Vader",
      "mail": "celinarogers@biolive.com"
    },
    "1": {
      "name": "Donald Duck",
      "mail": "kleinwhitehead@decratex.com"
    },
    "2": {
      "name": "Luke Skywalker",
      "mail": "earlenebowers@genmex.com"
    }
  },
  "sessions": [
    {
      "id": 0,
      "title": "The java script framework of the century",
      "description": "Id nisi officia non aliquip voluptate ad cupidatat enim ea consectetur nulla do sit sit. Fugiat dolore consequat enim mollit ut ut eiusmod adipisicing in. Ea tempor ipsum et nisi. Occaecat et dolore consequat aute sit ex irure qui consectetur nostrud duis Lorem irure quis.",
      "category": "Testing",
      "lengthInMinutes": 120,
      "presenter": 0,
      "room": 0,
      "startTime": ""
    },
    {
      "id": 1,
      "title": "The java script framework of the century",
      "description": "Voluptate cillum laborum dolor anim laborum exercitation proident exercitation commodo quis. Anim tempor deserunt occaecat consequat pariatur occaecat Lorem et sunt. Ipsum irure aliqua elit dolor excepteur consectetur et consectetur eu reprehenderit dolore. Ea est dolor nulla ut aliquip dolore voluptate dolor nostrud.",
      "category": "Management",
      "lengthInMinutes": 180,
      "presenter": 2,
      "room": 1,
      "startTime": ""
    },
    {
      "id": 2,
      "title": "The c++ framework of the past",
      "description": "Excepteur anim cupidatat cupidatat exercitation aliqua velit quis qui sint est quis elit velit consectetur. In dolor ea et Lorem consectetur est eu ut veniam. In amet amet Lorem non laboris adipisicing. Consequat eiusmod non pariatur duis adipisicing labore mollit Lorem reprehenderit do sunt.",
      "category": "Cloud",
      "lengthInMinutes": 60,
      "presenter": 0,
      "room": 2,
      "startTime": ""
    },
    {
      "id": 3,
      "title": "The java framework of the century",
      "description": "Magna mollit culpa non eu excepteur Lorem in eiusmod veniam id. Est enim est labore adipisicing proident laboris qui amet laborum reprehenderit. Exercitation officia ex sit cillum ex in labore adipisicing. Magna ea est nisi ea pariatur consectetur minim dolore qui voluptate Lorem consectetur.",
      "category": "Project Management",
      "lengthInMinutes": 60,
      "presenter": 1,
      "room": 3,
      "startTime": ""
    },
    {
      "id": 4,
      "title": "The java script framework of the future",
      "description": "Laborum voluptate amet aute eiusmod commodo proident aliqua fugiat id labore enim culpa. Sint commodo tempor eiusmod pariatur consequat. Occaecat tempor aliqua labore cupidatat tempor aliquip aute ullamco qui nulla sit. Consequat nisi amet occaecat velit ut.",
      "category": "Cloud",
      "lengthInMinutes": 180,
      "presenter": 0,
      "room": 4,
      "startTime": ""
    },
    {
      "id": 5,
      "title": "The embedded framework of the century",
      "description": "Ullamco elit eiusmod dolor cupidatat Lorem aliquip deserunt. Qui Lorem deserunt est excepteur non incididunt labore ut labore elit laboris velit. Nisi eu anim do officia. Eiusmod laboris cupidatat sunt deserunt mollit exercitation culpa reprehenderit fugiat sunt est id.",
      "category": "Technology",
      "lengthInMinutes": 180,
      "presenter": 0,
      "room": 0,
      "startTime": ""
    },
    {
      "id": 6,
      "title": "The c++ framework of the future",
      "description": "Quis officia deserunt anim aliqua Lorem ex quis ad sit ullamco. Nisi enim minim nisi ad. Culpa eu dolor sunt mollit nisi cillum proident adipisicing eu ad ea adipisicing cillum. Velit sunt deserunt et veniam mollit eiusmod duis fugiat non amet proident.",
      "category": "Testing",
      "lengthInMinutes": 60,
      "presenter": 0,
      "room": 1,
      "startTime": ""
    },
    {
      "id": 7,
      "title": "The embedded framework of the future",
      "description": "Et nulla amet sint velit amet quis laborum. Veniam eu elit tempor cupidatat sunt enim id labore eu. Qui consectetur nisi eu dolore exercitation ex velit nostrud et dolor pariatur Lorem commodo ex. Non reprehenderit excepteur adipisicing sunt eiusmod esse anim reprehenderit culpa incididunt velit elit deserunt sint.",
      "category": "Management",
      "lengthInMinutes": 120,
      "presenter": 2,
      "room": 2,
      "startTime": ""
    },
    {
      "id": 8,
      "title": "The java framework of the century",
      "description": "Velit mollit adipisicing veniam voluptate labore. Sit esse quis laboris exercitation labore proident mollit non laborum do elit esse et ullamco. Laborum adipisicing veniam ullamco do et ad anim eiusmod ea. Magna sit ipsum non esse cupidatat nostrud.",
      "category": "Technology",
      "lengthInMinutes": 180,
      "presenter": 2,
      "room": 3,
      "startTime": ""
    },
    {
      "id": 9,
      "title": "The java framework of the future",
      "description": "Culpa ex dolore dolore irure deserunt et quis ea labore veniam ullamco commodo ex. Pariatur eu minim pariatur mollit sunt id sunt ipsum aliqua excepteur do tempor laborum. Veniam fugiat est ipsum anim. Occaecat et irure commodo ea elit.",
      "category": "Management",
      "lengthInMinutes": 120,
      "presenter": 1,
      "room": 4,
      "startTime": ""
    },
    {
      "id": 10,
      "title": "The c++ framework of the future",
      "description": "Voluptate anim exercitation in ullamco irure sint anim enim consectetur do mollit qui consequat minim. Qui adipisicing Lorem quis cupidatat aliqua. Aliquip aliquip laborum aliquip tempor. Minim incididunt anim commodo nisi culpa nisi laboris non culpa commodo velit.",
      "category": "Testing",
      "lengthInMinutes": 120,
      "presenter": 1,
      "room": 0,
      "startTime": ""
    },
    {
      "id": 11,
      "title": "The java framework of the future",
      "description": "Cupidatat irure aliqua magna nulla. Tempor culpa proident duis Lorem adipisicing id aliquip aliqua velit duis pariatur reprehenderit. Fugiat consequat voluptate Lorem nostrud nostrud consequat aliquip ullamco id anim eiusmod tempor. Incididunt minim non mollit ullamco.",
      "category": "Cloud",
      "lengthInMinutes": 180,
      "presenter": 0,
      "room": 1,
      "startTime": ""
    },
    {
      "id": 12,
      "title": "The java script framework of the future",
      "description": "Esse exercitation deserunt sunt adipisicing. Enim id ullamco voluptate sit minim mollit ipsum tempor culpa labore officia consequat irure nulla. Magna aliqua sunt occaecat eiusmod Lorem non veniam enim esse eu eu duis ex amet. Incididunt occaecat excepteur quis qui exercitation aliquip non exercitation.",
      "category": "Management",
      "lengthInMinutes": 120,
      "presenter": 2,
      "room": 2,
      "startTime": ""
    },
    {
      "id": 13,
      "title": "The c++ framework of the past",
      "description": "Ut eu cillum sint est consequat exercitation. Et officia occaecat duis pariatur excepteur duis. Aliquip eiusmod enim sunt ex ipsum. Id exercitation id excepteur non nostrud excepteur id tempor ut deserunt sint consequat consequat nisi.",
      "category": "Management",
      "lengthInMinutes": 180,
      "presenter": 2,
      "room": 3,
      "startTime": ""
    },
    {
      "id": 14,
      "title": "The c++ framework of the future",
      "description": "Eu reprehenderit ex officia velit commodo occaecat occaecat adipisicing. Tempor id nulla in ut occaecat commodo. Cillum eiusmod laborum laborum eiusmod. Cupidatat duis proident adipisicing qui.",
      "category": "Testing",
      "lengthInMinutes": 120,
      "presenter": 2,
      "room": 4,
      "startTime": ""
    },
    {
      "id": 15,
      "title": "The c++ framework of the century",
      "description": "Nostrud veniam aute anim Lorem occaecat Lorem exercitation aliqua. Incididunt sunt proident eu ad culpa elit officia deserunt incididunt. Eu nisi sint et tempor. Ullamco mollit fugiat dolor tempor incididunt velit aliquip officia nulla consequat.",
      "category": "Cloud",
      "lengthInMinutes": 60,
      "presenter": 0,
      "room": 0,
      "startTime": ""
    },
    {
      "id": 16,
      "title": "The java script framework of the past",
      "description": "Non esse proident dolore ipsum mollit. Elit laboris magna pariatur velit in aliquip proident excepteur magna. Est incididunt exercitation officia sint et pariatur do. Reprehenderit enim ex veniam nulla laborum ad.",
      "category": "Project Management",
      "lengthInMinutes": 60,
      "presenter": 0,
      "room": 1,
      "startTime": ""
    },
    {
      "id": 17,
      "title": "The java framework of the century",
      "description": "Dolor anim veniam dolor ad aute anim velit anim qui elit. Velit laborum ad veniam quis occaecat tempor aute deserunt excepteur occaecat do ut. Proident qui in commodo in esse et laboris ea mollit mollit enim culpa. Cupidatat aute aute cillum ea exercitation elit commodo duis esse sint excepteur adipisicing.",
      "category": "Management",
      "lengthInMinutes": 60,
      "presenter": 2,
      "room": 2,
      "startTime": ""
    },
    {
      "id": 18,
      "title": "The embedded framework of the future",
      "description": "Ad qui elit et excepteur dolor occaecat dolor dolore labore in. Pariatur consequat ullamco elit Lorem minim sunt voluptate est in id id eiusmod ipsum. In nisi officia do commodo ea laborum duis nostrud dolore ut laborum cupidatat. Consectetur qui fugiat officia ullamco aliqua dolor labore nisi fugiat cillum elit.",
      "category": "Management",
      "lengthInMinutes": 120,
      "presenter": 2,
      "room": 3,
      "startTime": ""
    },
    {
      "id": 19,
      "title": "The java script framework of the century",
      "description": "Laborum sit mollit tempor duis ullamco. Eu labore duis pariatur commodo fugiat est. Irure qui sunt do aute labore quis pariatur deserunt. Esse sit esse exercitation elit et ad.",
      "category": "Testing",
      "lengthInMinutes": 180,
      "presenter": 0,
      "room": 4,
      "startTime": ""
    }
  ]
}