{
  "rooms": {
    "0": {
      "id": 0,
      "name": "Room 101",
      "size": "40"
    },
    "1": {
      "id": 1,
      "name": "Room 111",
      "size": "40"
    },
    "2": {
      "id": 2,
      "name": "Room 201",
      "size": "60"
    },
    "3": {
      "id": 3,
      "name": "Room 301",
      "size": "100"
    },
    "4": {
      "id": 4,
      "name": "Room 311",
      "size": "40"
    }
  },
  "presenters": [
    {
      "id": 0,
      "name": "Homer Simpson",
      "mail": "homer.simpson@info.com",
      "sessions": {
        "0": true,
        "2": true,
        "4": true,
        "5": true,
        "6": true,
        "11": true,
        "15": true,
        "19": true
      }
    },
    {
      "id": 1,
      "name": "John Snow",
      "mail": "john.snow@info.com",
      "sessions": {
        "1": true,
        "3": true,
        "9": true,
        "10": true
      }
    },
    {
      "id": 2,
      "name": "Walter White",
      "mail": "walter.white@hotmail.com",
      "sessions": {
        "1": true,
        "7": true,
        "8": true,
        "12": true,
        "13": true,
        "14": true,
        "17": true,
        "18": true
      }
    }
  ],
  "sessions": [
    {
      "id": 0,
      "title": "Android Application testing",
      "description": "Android unit and UI testing has not been a joyful experience in the past. This does not need to be the case anymore!.",
      "category": "Testing",
      "lengthInMinutes": 120,
      "presenter": 0,
      "room": 0,
      "attendees": [

      ],
      "startTime": "2015-09-24T09:30:00.000Z"
    },
    {
      "id": 1,
      "title": "Advanced AngularJS Topics for developers and architects",
      "description": "So you've completed the infamous 'Angular-Todo-App Tutorial' and feel like you've grasped the concepts of Angular. Now you're in a real-world Angular project and suddenly realise that you don't understand half of it. This Todo-App just doesn't quite cut it.",
      "category": "Technology",
      "lengthInMinutes": 180,
      "presenter": 2,
      "room": 1,
      "attendees": [

      ],
      "startTime": "2015-09-24T09:30:00.000Z"
    },
    {
      "id": 2,
      "title": "Connect systems? .NET Service Bus!",
      "description": "Connect your systems and interfaces painless with a loosely coupled reliable inte-grated platform using NServiceBus. Implement a Service Bus .NET solution in 60 minutes from scratch.",
      "category": "Cloud",
      "lengthInMinutes": 60,
      "presenter": 0,
      "room": 2,
      "attendees": [

      ],
      "startTime": "2015-09-24T09:30:00.000Z"
    },
    {
      "id": 3,
      "title": "Applied Risk Management",
      "description": "Do you care about risk management in projects? Are you interested in a practicable risk analysis method? Then join this tutorial!",
      "category": "Project Management",
      "lengthInMinutes": 60,
      "presenter": 1,
      "room": 3,
      "attendees": [

      ],
      "startTime": "2015-09-24T09:30:00.000Z"
    },
    {
      "id": 4,
      "title": "IoT Introduction",
      "description": "IOT is a new Business Unit within Zühlke. The session should introduce the unit with its strategic goals, types of projects.",
      "category": "Cloud",
      "lengthInMinutes": 180,
      "presenter": 0,
      "room": 4,
      "attendees": [

      ],
      "startTime": "2015-09-24T09:30:00.000Z"
    },
    {
      "id": 5,
      "title": "Jass Challenge - popular swiss card game with bots",
      "description": "The Challenge is a Jass version of the lean-poker project. We will show an example implementation where bots play against real humans.",
      "category": "Technology",
      "lengthInMinutes": 180,
      "presenter": 0,
      "room": 0,
      "attendees": [

      ],
      "startTime": "2015-09-24T14:00:00.000Z"
    },
    {
      "id": 6,
      "title": "Bad Practices of Testing",
      "description": "We practice test driven development to ensure high quality of the software, but what about the quality of the tests? Are our tests of high quality? Do we give them as much attention as we give to the implementation? What mistakes do we do when writing tests? What details do we forget about? Can you tell what is wrong with this snippet of the test code and how to improve it? This interactive presentation challenges you to identify the problems in the test code and allows to discuss ways for improvement.",
      "category": "Testing",
      "lengthInMinutes": 60,
      "presenter": 0,
      "room": 1,
      "attendees": [

      ],
      "startTime": "2015-09-24T14:00:00.000Z"
    },
    {
      "id": 7,
      "title": "JavaFX 8 Workshop",
      "description": "JavFX 8 brings back the fun of desktop GUI development",
      "category": "Technology",
      "lengthInMinutes": 120,
      "presenter": 2,
      "room": 2,
      "attendees": [

      ],
      "startTime": "2015-09-24T10:30:00.000Z"
    },
    {
      "id": 8,
      "title": "Real World Functional Programming",
      "description": "Using a functional programming language in a project can be rewarding in many ways. Still, trying to do so within a client project requires convincing the client to be allowed to do so. In the session, I will show how converting a small C#-project to F# in several steps can serve the first two purposes while demonstrating the tool support within Visual Studio along the way. If you want to get to know F#, learn about the benefits of functional programming languages or a way to convince customers to allow for using a functional language, this session is for you.",
      "category": "Technology",
      "lengthInMinutes": 180,
      "presenter": 2,
      "room": 3,
      "attendees": [

      ],
      "startTime": "2015-09-24T10:30:00.000Z"
    },
    {
      "id": 9,
      "title": "Business Innovation",
      "description": "Fundamentally, Zuhlke will be successful if we make our clients successful. This tutorial focusses on how we can use advanced engineering tehcniques to make our clients successful with through innovation in their businesses. We will review the many dimensions that businesses can innovate in and show how we can enable such innovation through advanced engineering.",
      "category": "Management",
      "lengthInMinutes": 120,
      "presenter": 1,
      "room": 4,
      "attendees": [

      ],
      "startTime": "2015-09-24T14:00:00.000Z"
    },
    {
      "id": 10,
      "title": "End2End testing for Angular apps with Protractor",
      "description": "Protractor is a framework for automated E2E testing of Angular applications. In this session I will share my experience of using Proctractor on one of our recent procjects.",
      "category": "Testing",
      "lengthInMinutes": 120,
      "presenter": 1,
      "room": 0,
      "startTime": ""
    },
    {
      "id": 11,
      "title": "Building Data-Visualizations with D3",
      "description": "[DA Track] D3 (www.d3js.org) is a JavaScript Library for binding Data to graphical Objects and building powerful, interactive Data-Visualizations for the Web. Since the demand for Data-Visualization within Rich Web-Applications has risen over the last years, this hands-on Workshop will introduce best-practices using the D3-Library and helps overcoming common difficulties in first-time usage of the API.",
      "category": "Cloud",
      "lengthInMinutes": 180,
      "presenter": 0,
      "room": 1,
      "startTime": "2015-09-25T14:00:00.000Z"
    },
    {
      "id": 12,
      "title": "Innovation in Asia - How can we profit?",
      "description": "Asia is currently the center of economic groth and innovative local firms become strong competitors for western enterprises. Therefore, to stay competitive, we have to ask ourselfe the question What makes those firm so strong? and How can we profit form their way of doing business? ",
      "category": "Management",
      "lengthInMinutes": 120,
      "presenter": 2,
      "room": 2,
      "startTime": "2015-09-25T14:00:00.000Z"
    },
    {
      "id": 13,
      "title": "Culture Clash in Interdisciplinary Projects",
      "description": "Quiet a lot of problems when people work together in interdisciplinary projects have their profound cause in the different schools people have passed through during their education and career. I would like to tell you some eyewitness accounts from my time at Zuehlke and before. I hope you find some hints how to nip problems in the bud in your projects.",
      "category": "Management",
      "lengthInMinutes": 180,
      "presenter": 2,
      "room": 3,
      "startTime": "2015-09-25T14:00:00.000Z"
    },
    {
      "id": 14,
      "title": "Spice up your User Interface Tests using Scenarioo",
      "description": "Automated User Interface tests are very powerful and invaluable, when you make them visible and accessible to all involved people in your project. This is why we developed the open source project Scenarioo for automatically documenting software systems from a User Interface perspective using UI tests. We already use this approach successfully in several larger projects. If you want to get handson experience on how to use Scenarioo for creating a feature rich UI-driven system documentation by integrating it into your UI tests, this session is for you.",
      "category": "Testing",
      "lengthInMinutes": 120,
      "presenter": 2,
      "room": 4,
      "startTime": "2015-09-25T14:00:00.000Z"
    },
    {
      "id": 15,
      "title": "Windows on Devices: Windows 10 IoT Core Hands-On",
      "description": "With Windows 10 IoT for Small Devices, we will be getting a new OS offering designed for embedded and IoT devices. Learn more about the unique capabilites of this new OS and how to write portable solutions, You'll have the opportunity to get your hands dirty experimenting with this new OS on actual hardware like a Rhasperry PI 2.",
      "category": "Cloud",
      "lengthInMinutes": 60,
      "presenter": 0,
      "room": 0,
      "startTime": "2015-09-25T14:00:00.000Z"
    },
    {
      "id": 16,
      "title": "Cost Reduction in a nutshell",
      "description": "We cannot just ask customers what they want. By the way they want something built, they'll want soemthing new (Steve Jobs). So it requires fast experimentation, empty or early delivery, agility!", "category": "Project Management",
      "lengthInMinutes": 60,
      "presenter": 0,
      "room": 1,
      "startTime": "2015-09-25T14:00:00.000Z"
    },
    {
      "id": 17,
      "title": "A brilliant mind - understand persuation and motivation",
      "description": "Knowledge about what is influencing human decisions help you protect yourself from bad influence and understand how to positive motivate other people.",
      "category": "Management",
      "lengthInMinutes": 60,
      "presenter": 2,
      "room": 2,
      "startTime": "2015-09-25T14:00:00.000Z"
    },
    {
      "id": 18,
      "title": "Basics of mobile development with Ionic and Firebase",
      "description": "The Ionic framework provides a quick and familiar way for web developers to create rich mobile applications using anglular.js and cordova. Firebase is an online JSON database. We will put together a simple application to see how it all hangs togther.",
      "category": "Technology",
      "lengthInMinutes": 120,
      "presenter": 2,
      "room": 3,
      "startTime": "2015-09-25T14:00:00.000Z"
    },
    {
      "id": 19,
      "title": "Developing for Apple Watch",
      "description": "Learn how to develop an Apple Watch app! Dive into the basic architecture and UI concepts of watch apps, take a look at Apple’s new programming language Swift and try out our demo app on the real device.", "category": "Technology",
      "lengthInMinutes": 180,
      "presenter": 0,
      "room": 4,
      "startTime": "2015-09-25T14:00:00.000Z"
    }
  ],
  "users" : {
    "simplelogin:14" : {
      "email" : "hans@test.ch",
      "firstname" : "Hans",
      "lastname" : "Meier"
    },
    "simplelogin:16" : {
      "email" : "joachim.prinzbach@zuehlke.com",
      "firstname" : "Joachim",
      "lastname" : "Prinzbach",
      "password" : ")cNNCHt^hb4A50qj"
    },
    "simplelogin:17" : {
      "email" : "daniel.suter@zuehlke.com",
      "firstname" : "Daniel",
      "lastname" : "Suter",
      "password" : "LAN3NKDCxtbd!u@A"
    }
  }
}

