{
    "session" :
        [
            {
                "id": 0,
                "title": "The java script framework of the futere",
                "description": "Do dolor sit do nisi. Ad dolore id aliqua dolor. Dolor non excepteur anim duis qui reprehenderit cillum Lorem sit deserunt. Nulla nulla id magna cupidatat elit velit do amet eu irure ea esse do consequat.",
                "category": "Management",
                "lengthInMinutes": 120,
                "presenter": "Darh Vader"
            },
            {
                "id": 1,
                "title": "The java script framework of the futere",
                "description": "Labore magna ad elit et dolore commodo in incididunt voluptate et veniam voluptate sunt. Esse do amet commodo excepteur minim ex occaecat veniam aliquip. Qui sint qui est qui non eiusmod magna magna. Minim consectetur anim nisi tempor consequat.",
                "category": "Project Management",
                "lengthInMinutes": 180,
                "presenter": "Darh Vader"
            },
            {
                "id": 2,
                "title": "The embedded framework of the past",
                "description": "Qui commodo officia ipsum esse ipsum. Occaecat amet voluptate laborum aliqua commodo deserunt laboris dolor do consectetur laborum ullamco tempor. Est aute ad velit ex in deserunt. Qui voluptate pariatur cupidatat fugiat id in cupidatat qui elit fugiat.",
                "category": "Technology",
                "lengthInMinutes": 180,
                "presenter": "Darh Vader"
            },
            {
                "id": 3,
                "title": "The java framework of the past",
                "description": "Quis aliqua quis reprehenderit proident mollit dolore magna dolore nisi laborum. Sit exercitation sunt consectetur sint eu ad fugiat labore ea. In officia esse Lorem mollit dolor dolore eiusmod excepteur fugiat est voluptate deserunt labore sunt. Minim enim id et ad.",
                "category": "Management",
                "lengthInMinutes": 120,
                "presenter": "Darh Vader"
            },
            {
                "id": 4,
                "title": "The java script framework of the futere",
                "description": "Nulla irure et amet veniam tempor adipisicing adipisicing pariatur est dolor laborum dolore proident. Sint ut duis occaecat cillum nulla esse. Quis tempor eiusmod adipisicing sunt non ipsum deserunt ut cupidatat adipisicing est labore aliqua. Aliqua magna irure reprehenderit sint cupidatat id aute magna fugiat nulla.",
                "category": "Cloud",
                "lengthInMinutes": 60,
                "presenter": "Luke Skywalker"
            },
            {
                "id": 5,
                "title": "The java script framework of the futere",
                "description": "Laboris enim labore laborum quis id elit velit consequat. Mollit non ullamco magna deserunt sint elit minim culpa amet aliquip irure anim. Nisi Lorem laborum irure consectetur consequat laborum anim ipsum laboris. Velit nisi ut sit esse voluptate ut.",
                "category": "Cloud",
                "lengthInMinutes": 180,
                "presenter": "Luke Skywalker"
            },
            {
                "id": 6,
                "title": "The c++ framework of the futere",
                "description": "Minim duis cillum velit nostrud dolore veniam et officia est ex pariatur sit nostrud. Exercitation mollit sunt veniam id laborum qui amet pariatur anim sit ex pariatur nulla. Nostrud laborum tempor quis minim eu ea reprehenderit id dolore aliquip anim aute deserunt. Est laboris sint sit quis sit sit velit elit enim qui magna exercitation cupidatat nisi.",
                "category": "Testing",
                "lengthInMinutes": 60,
                "presenter": "Luke Skywalker"
            },
            {
                "id": 7,
                "title": "The java script framework of the century",
                "description": "Sit enim amet elit nisi ad et ipsum enim. Aliqua sint proident amet nostrud ad. Dolor magna ipsum reprehenderit deserunt sunt eiusmod enim nostrud cupidatat. Reprehenderit nisi sunt est consequat est ex proident ipsum in in fugiat in non.",
                "category": "Testing",
                "lengthInMinutes": 180,
                "presenter": "Luke Skywalker"
            },
            {
                "id": 8,
                "title": "The embedded framework of the past",
                "description": "Deserunt mollit ipsum irure cupidatat dolor. Reprehenderit consequat sint sint eu id occaecat dolore velit aute. In sunt cillum irure ullamco cupidatat qui id deserunt esse ea aliquip est labore incididunt. Dolor qui excepteur consectetur consequat deserunt voluptate aliqua magna et aliquip et nulla.",
                "category": "Technology",
                "lengthInMinutes": 60,
                "presenter": "Darh Vader"
            },
            {
                "id": 9,
                "title": "The java framework of the past",
                "description": "Velit proident mollit in ullamco veniam laborum. Ullamco minim sit commodo quis enim nulla officia veniam deserunt ad laborum esse velit. Pariatur quis consectetur pariatur labore esse. Qui excepteur reprehenderit proident anim nostrud id deserunt magna ad.",
                "category": "Project Management",
                "lengthInMinutes": 120,
                "presenter": "Donald Duck"
            },
            {
                "id": 10,
                "title": "The embedded framework of the century",
                "description": "Consectetur dolor dolor non occaecat ad tempor. Ullamco officia excepteur sit est velit reprehenderit non excepteur ad ut nostrud ullamco amet eu. Veniam qui non exercitation proident mollit cupidatat tempor Lorem amet do minim veniam. Laborum laborum aliqua laboris minim sunt ut excepteur duis ut commodo laborum.",
                "category": "Cloud",
                "lengthInMinutes": 180,
                "presenter": "Luke Skywalker"
            },
            {
                "id": 11,
                "title": "The embedded framework of the futere",
                "description": "Nulla minim duis in amet id incididunt veniam ullamco in. Qui amet occaecat qui in do amet voluptate culpa veniam et. Reprehenderit sunt nostrud elit consectetur est laboris magna. Do aliquip cupidatat et laboris dolor cillum incididunt nulla ex adipisicing.",
                "category": "Management",
                "lengthInMinutes": 180,
                "presenter": "Darh Vader"
            },
            {
                "id": 12,
                "title": "The c++ framework of the futere",
                "description": "Deserunt est non officia consequat fugiat in esse nulla elit qui ut exercitation irure cillum. Ut ex do duis id est qui aute dolore. Occaecat excepteur culpa sit cillum et quis sit veniam reprehenderit. Consequat aute duis quis dolore occaecat est.",
                "category": "Testing",
                "lengthInMinutes": 180,
                "presenter": "Luke Skywalker"
            },
            {
                "id": 13,
                "title": "The java script framework of the century",
                "description": "Veniam eu pariatur incididunt sit cillum qui ipsum proident do duis commodo irure. Enim veniam ipsum excepteur ad cillum eu. Occaecat reprehenderit occaecat sint officia deserunt reprehenderit culpa deserunt laborum. Aliqua adipisicing Lorem labore duis aliquip fugiat tempor quis non.",
                "category": "Management",
                "lengthInMinutes": 60,
                "presenter": "Darh Vader"
            },
            {
                "id": 14,
                "title": "The embedded framework of the past",
                "description": "Mollit aliquip proident ex ex incididunt non do cupidatat. Voluptate enim sit cillum est elit. Ad mollit ipsum consequat officia mollit nostrud mollit duis id. Ut non cupidatat magna enim cupidatat adipisicing elit duis.",
                "category": "Cloud",
                "lengthInMinutes": 180,
                "presenter": "Darh Vader"
            },
            {
                "id": 15,
                "title": "The java script framework of the past",
                "description": "Anim ea amet id incididunt voluptate minim adipisicing consequat nulla eu nulla labore sint. Qui aute exercitation fugiat laboris pariatur. Nostrud adipisicing officia et elit exercitation est aliqua minim proident. Dolore exercitation ipsum elit deserunt est nostrud nulla aliquip reprehenderit Lorem velit.",
                "category": "Management",
                "lengthInMinutes": 60,
                "presenter": "Donald Duck"
            },
            {
                "id": 16,
                "title": "The c++ framework of the past",
                "description": "Minim ullamco sint commodo labore commodo culpa reprehenderit aliqua sunt eu culpa ex. Occaecat do deserunt occaecat voluptate aliqua laborum ullamco officia excepteur dolore voluptate. Aute laboris elit labore aute duis ea ipsum labore. Pariatur veniam deserunt anim irure dolor duis dolor id elit Lorem enim non.",
                "category": "Cloud",
                "lengthInMinutes": 180,
                "presenter": "Luke Skywalker"
            },
            {
                "id": 17,
                "title": "The c++ framework of the futere",
                "description": "Ut nisi laborum non officia aute nostrud aliqua est dolor adipisicing laboris incididunt. Ex duis pariatur dolor dolor non elit eu. Officia qui incididunt ea laborum consequat ut elit sunt amet qui. Enim voluptate ex esse Lorem magna.",
                "category": "Project Management",
                "lengthInMinutes": 180,
                "presenter": "Darh Vader"
            },
            {
                "id": 18,
                "title": "The java script framework of the past",
                "description": "Sint magna nostrud cillum Lorem nisi veniam tempor esse. Do do nostrud laborum veniam veniam nisi consectetur. Et culpa ad aliqua sit pariatur. Deserunt sunt laboris cupidatat velit dolor proident.",
                "category": "Technology",
                "lengthInMinutes": 180,
                "presenter": "Donald Duck"
            },
            {
                "id": 19,
                "title": "The java script framework of the past",
                "description": "Cupidatat minim labore id veniam pariatur minim laborum dolore culpa officia. Dolor cupidatat exercitation elit consectetur deserunt ullamco aute pariatur veniam. Irure ad commodo enim id nostrud dolor est cupidatat sunt ad minim proident ipsum. Exercitation qui laborum eiusmod occaecat culpa in nulla magna quis commodo.",
                "category": "Management",
                "lengthInMinutes": 120,
                "presenter": "Luke Skywalker"
            }
        ]
}
